{
  "home": "Accueil",
  "portfolio": "Portfolio",
  "about-me": "A propos de moi",
  "contact": "Contact",
  "welcome-to": "Bienvenue sur mon",
  "portfolio-min": "portfolio",
  "subtitle": "Je suis un étudiant passionné par l'informatique",
  "see-my-projects": "Voir mes projets",
  "actual-learnings": "Mes apprentissages actuels",
  "programming-languages": "Langages de programmation",
  "frameworks-and-libraries": "Frameworks et librairies",
  "other-skills": "Autres compétences",
  "projects": "Projets",
  "all-projects": "Intégralité de mes réalisations sur mon profil Github",
  "github-raphael": "Github Raphaël PERRIN ▸",
  "languages": "Langues",
  "french": "Français",
  "mother-tongue": "Langue maternelle",
  "english": "Anglais",
  "B2-skill": "B2 - Compétences de communication professionnelle",
  "linguaskill": "Certification Linguaskill B2 obtenue en 2021",
  "german": "Allemand",
  "B1-skill": "B1 - Compétences de communication professionnelle limitée",
  "goethe": "Certification Goethe Institut B1 obtenue en 2023",
  "norwegian": "Norvégien",
  "A1-beginner": "A1 - Débutant",
  "personal-learning": "Apprentissage personnel",
  "italian": "Italien",
  "personal-learning-semester": "Apprentissage personnel et lors d'un semestre d'études",
  "half-year-results": "Résultats semestriels",
  "autumn-2022": "Automne 2022",
  "spring-2023": "Printemps 2023",
  "spring-2024": "Printemps 2024",
  "more-information": "Plus d'informations ▸",

  "i-am-passionate-about": "Je suis passionné par l'",
  "the": ", la",
  "i-get-involved": "et je m'investis beaucoup dans mon travail.",

  "computer-science": "informatique",
  "programming": "programmation",
  "project-management": "gestion de projets",

  "subject": "Matière",
  "description": "Description",
  "mark": "Note",
  "ETCS": "ECTS",
  "credits": "crédits",

  "crunchtime": "Crunchtime - Evenement d'une semaine organisé par l'UTBM",
  "mv50": "Projet de migration d'un escape game VR en Réalité Augmentée",
  "mv51": "Géométrie pour l'image",
  "mv52": "Synthèse d'images et Blender",
  "mv53": "Interface Utilisateur pour la Réalité Virtuelle",
  "mv54": "Rendu d'image et Réalité Virtuelle Augmentée",
  "sl01": "Suivi linguistique : Allemand",
  "so01": "Sociologie du travail",

  "hm40": "Interface Homme Machine",
  "rs40": "Réseau et Cybersécurité",
  "si40": "Systèmes d'information",
  "we4a": "Introduction à la programmation WEB",
  "we4b": "Initiation à Unity",
  "lg03": "Allemand niveau 3 et certification Goethe Institut",
  "ge06": "Fondements du marketing",

  "ap4a": "Programmation Orientée Objet en C++",
  "ap4b": "Programmation Orientée Objet en Java",
  "ia41": "Concepts fondamentaux de l'Intelligence Artificielle",
  "it46": "Traitement de l'information",
  "pc40": "Calcul parallèle",
  "lg02": "Allemand niveau 2",
  "ei03": "Sécurité internationale et défis mondiaux",

  "about-me-text-1": "Je m'appelle Raphaël PERRIN. Je suis actuellement en spécialité informatique en 4eme année à l'Université de Technologie de Belfort-Montbéliard (UTBM).",
  "about-me-text-3": "Je suis également passionné par le visionnage de films et la lecture de livres en allemand, tout en appréciant les sorties entre amis et les rencontres avec de nouvelles personnes.",

  "logo-conception": "Conception de logos",
  "logo-conception-text": "J'ai conçu plusieurs logos avec Adobe Illustrator pour divers clubs et projets étudiants de l'UTBM. Ces logos ont servi à promouvoir et représenter les clubs et projets concernés.",
  "sweat-stickers-conception": "Conception de sweat et stickers",

  "designed": "J'ai conçu un",
  "unique-sweat": "sweatshirt unique",
  "group": "pour un groupe de 16 personnes.",
  "sweat-conception-text-2": "Après consultation, nous avons choisi la broderie pour l'impression. Nous avons ensuite collaboré pour créer le design en tenant compte des attentes et suggestions du groupe. Pour choisir la couleur du sweat, nous avons utilisé un vote à jugement majoritaire afin de respecter les préférences de chacun.",

  "opportunity": "J'ai eu l'opportunité de collaborer avec le ",
  "promotion-office": "bureau de promotion",
  "stickers-design": "pour créer des designs de stickers qui seront distribués à un grand nombre d'étudiants.",

  "contact-me": "Contactez moi via LinkedIn ou par e-mail :",
  "all-rights-reserved": "© Raphael PERRIN - Tous droits réservés.",
  "website-realised": "Site web réalisé en React de A à Z par mes soins.",

  "tetris_introduction": "Tetris est un jeu d'arcade classique où le but est d'empiler des pièces géométriques tombantes pour former des lignes horizontales complètes et marquer des points.",
  "tetris_description": "Le développement du projet Tetris en utilisant Swing en Java a permis de mettre en pratique pour la première fois des concepts liés à la programmation orientée objet.\n\nCe projet a également été une occasion de renforcer les compétences en gestion de fichiers properties pour offrir des options multilingues, ainsi qu'en intégration de musiques pour améliorer l'expérience utilisateur.\n\nCette expérience a conduit à une compréhension approfondie de l'architecture et des techniques de programmation, préparant ainsi à relever des défis similaires à l'avenir et à améliorer les compétences en développement logiciel.",
  "azul_introduction": "Azul est un jeu stratégique pour 2 à 4 joueurs qui décorent un palais portugais avec des carreaux colorés. Le but est de marquer des points en créant des motifs sur un plateau personnel, en choisissant et plaçant astucieusement les tuiles pour maximiser les scores et minimiser les pénalités.",
  "azul_description": "L'architecture MVC (Modèle, Vue, Contrôleur) a été adoptée pour simplifier la répartition des responsabilités et garantir un programme robuste, facilement modifiable pour de futures adaptations. Afin d'optimiser la productivité et de fournir des repères clairs, plusieurs diagrammes UML ont été élaborés pour déterminer les exigences et les besoins du projet. Ensuite, divers diagrammes de classes ont été conçus pour établir l'architecture idéale avant d'entamer la phase de codage.\n\nCe projet a représenté une opportunité précieuse pour renforcer les compétences en architecture logicielle, en enrichissant la connaissance du développement au-delà de la simple programmation.",
  "twitturtle_introduction": "Jeu de mot entre Twitter et Turtle : Site internet dérivé du célèbre réseau social, spécialisé pour les maitres d'animaux avec des fonctionnalités supplémentaires, telles que :\n\n➜ La possibilité d'ajouter un animal sur son profil\n➜ Taguer des animaux sur un message, y ajouter une localisation et un type de message (événément, conseil, sauvetage)\n➜ Adopter un animal grâce à un système de demande et notification\n➜ Et encore plein d'autres fonctionnalités",
  "twitturtle_description": "Ce projet a représenté une opportunité exceptionnelle pour le développement de compétences dans divers domaines. Il a permis l'initiation à JavaScript et l'exploration de différentes API, notamment celles proposées par Google Cloud.\n\n En outre, de nouvelles compétences ont été acquises en envoyant des emails grâce à la bibliothèque PHPMailer et en utilisant les services de l'entreprise Sendinblue.",
  "pogo_introduction": "Pogo est un jeu de stratégie pour deux joueurs, adapté aux enfants de 6 ans et plus. Il est simple à apprendre (environ 2 minutes) et rapide à jouer (environ 10 minutes). Le jeu comprend un plateau de neuf cases et douze pièces empilables (six claires et six foncées). L'objectif est d'être le premier joueur à placer une pièce de sa couleur au sommet de chaque pile sur le plateau.\n\nDans ce jeu réadapté sur ordinateur, une IA a la possibilité de se battre contre un utilisateur ou contre elle-même.",
  "pogo_description": "Un défi majeur de ce projet consistait à concevoir une méthode d'évaluation permettant de déterminer le meilleur coup pour l'IA. Cette évaluation intégrait divers facteurs, tels que la position de la tour, le nombre de jetons en sa possession, la capacité de capturer une tour adverse ou de se protéger d'une capture, ainsi que la distance de déplacement possible.\n\nCe projet a permis de renforcer les compétences en Python et de comprendre l'implémentation de l'algorithme MinMax. Parallèlement, des compétences en création d'interfaces graphiques ont été développées en utilisant la bibliothèque QT.",
  "unity_introduction": "Petit projet réalisé sur Unity, qui comporte 3 mini jeux différents :\n\n➜ Apple Catcher\n➜ Brick Breaker\n➜ Furapi Bird",
  "unity_description": "Ce projet a offert l'opportunité de découvrir le fonctionnement de Unity ainsi que d'explorer de nouvelles possibilités en matière de conception de jeux. Il a également permis de s'initier au langage de programmation C#. Étant très proche de Java, ce langage a facilité l'adaptation et la mise à profit des compétences acquises au cours du projet.",

  "ludiq_introduction": "Ludiq est une plateforme dédiée au partage de hobbies et d'activités à travers un site web. Les utilisateurs peuvent y créer des discussions, publier des posts, organiser des activités et des événements liés à leurs centres d'intérêt. Ces événements sont ouverts aux membres partageant les mêmes passions.",
  "ludiq_description": "Le projet a été développé avec une architecture Backend en PHP et un Front-end en Angular. Pour assurer une structure robuste, une architecture Model - Services - Controller a été mise en place.\n\nCe projet a offert l'opportunité de se familiariser avec un framework et de maîtriser la notion de composants, permettant ainsi de réaliser des sites web plus flexibles et durables dans le temps.",

  "technologies": "Technologies",
  "project-realization": "Réalisation du projet",
  "introduction": "Introduction",

  "ut_barista_description": "Club de l'UTBM responsable de l'approvisionnement et de l'entretien des machines à café dans les espaces de vie.",
  "outbm_description": "Club LGBT de l'UTBM.",
  "ut_rc_description": "Club de l'UTBM dédié aux passionnés de véhicules et dispositifs contrôlés à distance via des signaux radio, tels que des voitures, drones, etc.",
  "coust_ut_description": "Club de couture, crochet de l'UTBM.",
  "eventum_description": "Site internet créé dans le cadre d'un projet de l'UTBM visant à rassembler les étudiants pour des sorties, soirées et autres événements.",

  "internship": "Stage",
  "axopen_info": "J’ai eu l’opportunité de pouvoir travailler dans l’entreprise Axopen dans le cadre de mon stage d’assistant ingénieur lors de ma quatrième année d’études. Il s’agit d’une entreprise spécialisée dans le développement web et audits. Ce stage m’a permis de développer mes compétences dans le domaine du développement web et de m’immerger dans l’environnement professionnel tout en collaborant au sein d’une équipe.",
  "axopen_project_one": "Il s’agissait d’un projet destiné à mettre en place un programme permettant de générer des schémas SVG représentants l’architecture entre des applications, hébergements, services et en expliquer le fonctionnement à travers des processus ou liaisons. Ce projet m’a permis de développer mes compétences avec le langage de programmation C# ainsi que sur le framework .NET. Il m’a également permis de m’initier à GitLab, une plateforme de développement et d’hébergement basée sur Git.",
  "axopen_project_two": "Il s’agissait de la mise en place d’un portail à destination d’un client pour lui faciliter la vérification de fichiers EXCEL envoyés par des représentants de pays. Ce projet m’a permis de développer mes compétences en travail d’équipe, d’appréhender davantage aux frameworks comme Laravel (dont le langage de programmation est PHP) du côté du back-end ou React pour le front-end.",
  "axopen_period": "Septembre 2023 - Février 2024",
  "axopen_project_one_title": "Premier project - Schémas SI",
  "axopen_project_two_title": "Deuxième projet - Portail RH"
}
