{
  "home": "Startseite",
  "portfolio": "Portfolio",
  "about-me": "Über mich",
  "contact": "Kontakt",
  "welcome-to": "Willkommen auf meinem",
  "portfolio-min": "Portfolio",
  "subtitle": "Ich bin ein Student, der sich für Informatik begeistert",
  "see-my-projects": "Meine Projekte ansehen",
  "actual-learnings": "Meine aktuellen Lerninhalte",
  "programming-languages": "Programmiersprachen",
  "frameworks-and-libraries": "Frameworks und Bibliotheken",
  "other-skills": "Weitere Fähigkeiten",
  "projects": "Projekte",
  "all-projects": "Alle meine Arbeiten auf meinem Github-Profil",
  "github-raphael": "Raphaël PERRINs Github ▸",
  "languages": "Sprachen",
  "french": "Französisch",
  "mother-tongue": "Muttersprache",
  "english": "Englisch",
  "B2-skill": "B2 - Berufliche Kommunikationsfähigkeiten",
  "linguaskill": "Linguaskill B2-Zertifikat erhalten im Jahr 2021",
  "german": "Deutsch",
  "B1-skill": "B1 - Begrenzte berufliche Kommunikationsfähigkeiten",
  "goethe": "Goethe Institut B1-Zertifikat erhalten im Jahr 2023",
  "norwegian": "Norwegisch",
  "A1-beginner": "A1 - Anfänger",
  "personal-learning": "Selbststudium",
  "italian": "Italienisch",
  "personal-learning-semester": "Selbststudium und während eines Studiensemesters",
  "half-year-results": "Semesterergebnisse",
  "autumn-2022": "Herbst 2022",
  "spring-2023": "Frühling 2023",
  "spring-2024": "Frühling 2024",
  "more-information": "Mehr Informationen ▸",

  "i-am-passionate-about": "Ich bin begeistert von",
  "the": ",",
  "i-get-involved": "und ich investiere viel in meine Arbeit.",

  "computer-science": "Informatik",
  "programming": "Programmierung",
  "project-management": "Projektmanagement",

  "subject": "Fach",
  "description": "Beschreibung",
  "mark": "Note",
  "ETCS": "ECTS",
  "credits": "Credits",

  "crunchtime": "Crunchtime - Eine einwöchige Veranstaltung organisiert von der UTBM",
  "mv50": "VR-Escape-Game-Migrationsprojekt in Augmented Reality",
  "mv51": "Geometrie für Bildgebung",
  "mv52": "Bildsynthese und Blender",
  "mv53": "Benutzeroberfläche für virtuelle Realität",
  "mv54": "Bildwiedergabe und Augmented Virtual Reality",
  "sl01": "Sprachverfolgung: Deutsch",
  "so01": "Arbeitssoziologie",

  "hm40": "Mensch-Maschine-Schnittstelle",
  "rs40": "Netzwerk und Cybersicherheit",
  "si40": "Informationssysteme",
  "we4a": "Einführung in die Webprogrammierung",
  "we4b": "Einführung in Unity",
  "lg03": "Deutsch Niveau 3 und Goethe Institut Zertifizierung",
  "ge06": "Marketing Grundlagen",

  "ap4a": "Objektorientierte Programmierung in C++",
  "ap4b": "Objektorientierte Programmierung in Java",
  "ia41": "Grundlegende Konzepte der Künstlichen Intelligenz",
  "it46": "Informationsverarbeitung",
  "pc40": "Paralleles Rechnen",
  "lg02": "Deutsch Niveau 2",
  "ei03": "Internationale Sicherheit und globale Herausforderungen",

  "about-me-text-1": "Mein Name ist Raphaël PERRIN. Ich spezialisiere mich derzeit auf Informatik im vierten Jahr an der Universität für Technologie von Belfort-Montbéliard (UTBM).",
  "about-me-text-3": "Ich bin auch begeistert vom Anschauen von Filmen und Lesen von Büchern auf Deutsch, während ich Ausflüge mit Freunden und Begegnungen mit neuen Menschen genieße.",

  "logo-conception": "Logogestaltung",
  "logo-conception-text": "Ich habe mehrere Logos mit Adobe Illustrator für verschiedene Clubs und Studentenprojekte an der UTBM entworfen. Diese Logos dienten dazu, die betreffenden Clubs und Projekte zu fördern und zu repräsentieren.",
  "sweat-stickers-conception": "Gestaltung von Sweatshirts und Aufklebern",

  "designed": "Ich habe ein",
  "unique-sweat": "einzigartiges Sweatshirt",
  "group": "für eine Gruppe von 16 Personen entworfen.",
  "sweat-conception-text-2": "Nach Rücksprache wählten wir Stickerei für den Druck. Wir arbeiteten dann zusammen, um das Design unter Berücksichtigung der Erwartungen und Vorschläge der Gruppe zu erstellen. Um die Farbe des Sweatshirts zu wählen, verwendeten wir eine Mehrheitsabstimmung, um die Vorlieben aller zu respektieren.",

  "opportunity": "Ich hatte die Gelegenheit, mit dem",
  "promotion-office": "Werbebüro",
  "stickers-design": "zusammenzuarbeiten, um Aufkleberdesigns zu erstellen, die an viele Studenten verteilt werden.",

  "contact-me": "Kontaktieren Sie mich über LinkedIn oder per E-Mail:",
  "all-rights-reserved": "© Raphael PERRIN - Alle Rechte vorbehalten.",
  "website-realised": "Website von mir in React von A bis Z erstellt.",

  "tetris_introduction": "Tetris ist ein klassisches Arcade-Spiel, bei dem es darum geht, fallende geometrische Teile so zu stapeln, dass vollständige horizontale Linien gebildet werden, um Punkte zu erzielen.",
  "tetris_description": "Die Entwicklung des Tetris-Projekts mit Swing in Java ermöglichte die praktische Anwendung objektorientierter Programmierkonzepte zum ersten Mal.\n\nDieses Projekt war auch eine Gelegenheit, Fähigkeiten im Umgang mit Eigenschaften-Dateien zu stärken, um mehrsprachige Optionen anzubieten, sowie Musik zu integrieren, um das Benutzererlebnis zu verbessern.\n\nDiese Erfahrung führte zu einem tiefen Verständnis von Architektur und Programmiertechniken, bereitete auf ähnliche Herausforderungen in der Zukunft vor und verbesserte die Softwareentwicklungskompetenzen.",
  "azul_introduction": "Azul ist ein strategisches Spiel für 2 bis 4 Spieler, die einen portugiesischen Palast mit bunten Fliesen dekorieren. Ziel ist es, Punkte zu erzielen, indem Muster auf einem persönlichen Brett erstellt werden, indem die Fliesen geschickt ausgewählt und platziert werden, um Punkte zu maximieren und Strafen zu minimieren.",
  "azul_description": "Die MVC-Architektur (Modell, Ansicht, Controller) wurde übernommen, um die Verteilung der Verantwortlichkeiten zu vereinfachen und ein robustes, leicht modifizierbares Programm für zukünftige Anpassungen zu gewährleisten. Um die Produktivität zu optimieren und klare Benchmarks zu liefern, wurden mehrere UML-Diagramme entwickelt, um die Anforderungen und Bedürfnisse des Projekts zu bestimmen. Dann wurden verschiedene Klassendiagramme entworfen, um die ideale Architektur zu etablieren, bevor die Codierungsphase begann.\n\nDieses Projekt war eine wertvolle Gelegenheit, die Fähigkeiten in der Softwarearchitektur zu stärken und das Wissen über die Entwicklung über die einfache Programmierung hinaus zu erweitern.",
  "twitturtle_introduction": "Ein Wortspiel zwischen Twitter und Turtle: Eine Website, die sich vom berühmten sozialen Netzwerk ableitet und sich auf Tierhalter spezialisiert, mit zusätzlichen Funktionen wie:\n\n➜ Die Möglichkeit, ein Tier zu Ihrem Profil hinzuzufügen.\n➜ Tiere in einem Beitrag zu markieren, einen Standort hinzuzufügen und einen Beitragstyp (Ereignis, Rat, Rettung)\n➜ Ein Tier durch ein Anfrage- und Benachrichtigungssystem zu adoptieren\n➜ Und viele weitere Funktionen",
  "twitturtle_description": "Dieses Projekt war eine außergewöhnliche Gelegenheit zur Entwicklung von Fähigkeiten in verschiedenen Bereichen. Es ermöglichte die Einführung in JavaScript und die Erkundung verschiedener APIs, insbesondere der von Google Cloud angebotenen.\n\nDarüber hinaus wurden neue Fähigkeiten erworben, indem E-Mails mit der PHPMailer-Bibliothek gesendet und die Dienste des Unternehmens Sendinblue genutzt wurden.",
  "pogo_introduction": "Pogo ist ein Strategiespiel für zwei Spieler, geeignet für Kinder ab 6 Jahren. Es ist einfach zu lernen (ca. 2 Minuten) und schnell zu spielen (ca. 10 Minuten). Das Spiel umfasst ein Brett mit neun Feldern und zwölf stapelbaren Spielfiguren (sechs helle und sechs dunkle). Ziel ist es, der erste Spieler zu sein, der eine Spielfigur seiner Farbe an der Spitze jeder Stapel auf dem Brett platziert.\n\nIn diesem auf dem Computer adaptierten Spiel kann eine KI gegen einen Benutzer oder gegen sich selbst kämpfen.",
  "pogo_description": "Eine große Herausforderung dieses Projekts bestand darin, eine Bewertungsmethode zu entwerfen, um den besten Zug für die KI zu bestimmen. Diese Bewertung integrierte verschiedene Faktoren wie die Position des Turms, die Anzahl der eigenen Spielfiguren, die Fähigkeit, einen gegnerischen Turm zu erobern oder sich vor einer Eroberung zu schützen, sowie die mögliche Bewegungsentfernung.\n\nDieses Projekt stärkte die Fähigkeiten in Python und das Verständnis der Implementierung des MinMax-Algorithmus. Darüber hinaus wurden Fähigkeiten zur Erstellung grafischer Benutzeroberflächen mit der QT-Bibliothek entwickelt.",
  "unity_introduction": "Kleines Projekt, das auf Unity realisiert wurde und 3 verschiedene Minispiele umfasst:\n\n➜ Apfel-Fänger\n➜ Brick Breaker\n➜ Furapi Bird",
  "unity_description": "Dieses Projekt bot die Gelegenheit, die Funktionsweise von Unity zu entdecken und neue Möglichkeiten im Spieldesign zu erkunden. Es ermöglichte auch die Einführung in die C#-Programmiersprache. Da sie Java sehr ähnlich ist, erleichterte diese Sprache die Anpassung und Nutzung der während des Projekts erworbenen Fähigkeiten.",
  "technologies": "Technologien",
  "project-realization": "Projektdurchführung",
  "introduction": "Einführung"
}
