{
  "home": "Home",
  "portfolio": "Portfolio",
  "about-me": "About me",
  "contact": "Contact",
  "welcome-to": "Welcome to my",
  "portfolio-min": "portfolio",
  "subtitle": "I am a student passionate about computer science",
  "see-my-projects": "See my projects",
  "actual-learnings": "My current learnings",
  "programming-languages": "Programming languages",
  "frameworks-and-libraries": "Frameworks and libraries",
  "other-skills": "Other skills",
  "projects": "Projects",
  "all-projects": "All my works on my Github profile",
  "github-raphael": "Raphaël PERRIN's Github ▸",
  "languages": "Languages",
  "french": "French",
  "mother-tongue": "Mother tongue",
  "english": "English",
  "B2-skill": "B2 - Professional communication skills",
  "linguaskill": "Linguaskill B2 certification obtained in 2021",
  "german": "German",
  "B1-skill": "B1 - Limited professional communication skills",
  "goethe": "Goethe Institut B1 certification obtained in 2023",
  "norwegian": "Norwegian",
  "A1-beginner": "A1 - Beginner",
  "personal-learning": "Personal learning",
  "italian": "Italian",
  "personal-learning-semester": "Personal learning and during a semester of studies",
  "half-year-results": "Semester results",
  "autumn-2022": "Autumn 2022",
  "spring-2023": "Spring 2023",
  "spring-2024": "Spring 2024",
  "more-information": "More information ▸",

  "i-am-passionate-about": "I am passionate about ",
  "the": ",",
  "i-get-involved": "and I am very involved in my work.",

  "computer-science": "computer science",
  "programming": "programming",
  "project-management": "project management",

  "subject": "Subject",
  "description": "Description",
  "mark": "Mark",
  "ETCS": "ECTS",
  "credits": "credits",

  "crunchtime": "Crunchtime - A one-week event organized by UTBM",
  "mv50": "VR escape game migration project to Augmented Reality",
  "mv51": "Geometry for imaging",
  "mv52": "Image synthesis and Blender",
  "mv53": "User Interface for Virtual Reality",
  "mv54": "Image rendering and Augmented Virtual Reality",
  "sl01": "Language tracking: German",
  "so01": "Sociology of work",

  "hm40": "Human-Machine Interface",
  "rs40": "Network and Cybersecurity",
  "si40": "Information systems",
  "we4a": "Introduction to WEB programming",
  "we4b": "Introduction to Unity",
  "lg03": "German level 3 and Goethe Institut certification",
  "ge06": "Marketing fundamentals",

  "ap4a": "Object-Oriented Programming in C++",
  "ap4b": "Object-Oriented Programming in Java",
  "ia41": "Fundamental concepts of Artificial Intelligence",
  "it46": "Information processing",
  "pc40": "Parallel computing",
  "lg02": "German level 2",
  "ei03": "International security and global challenges",

  "about-me-text-1": "My name is Raphaël PERRIN. I am currently specializing in computer science in my fourth year at the University of Technology of Belfort-Montbéliard (UTBM).",
  "about-me-text-3": "I am also passionate about watching movies and reading books in German, while enjoying outings with friends and meeting new people.",

  "logo-conception": "Logo design",
  "logo-conception-text": "I designed several logos with Adobe Illustrator for various clubs and student projects at UTBM. These logos were used to promote and represent the clubs and projects concerned.",
  "sweat-stickers-conception": "Sweatshirt and sticker design",

  "designed": "I designed a",
  "unique-sweat": "unique sweatshirt",
  "group": "for a group of 16 people.",
  "sweat-conception-text-2": "After consultation, we chose embroidery for the printing. We then collaborated to create the design, taking into account the group's expectations and suggestions. To choose the color of the sweatshirt, we used a majority judgment vote to respect everyone's preferences.",

  "opportunity": "I had the opportunity to collaborate with the",
  "promotion-office": "promotion office",
  "stickers-design": "to create sticker designs that will be distributed to a large number of students.",

  "contact-me": "Contact me via LinkedIn or by email:",
  "all-rights-reserved": "© Raphael PERRIN - All rights reserved.",
  "website-realised": "Website created in React from A to Z by myself.",

  "tetris_introduction": "Tetris is a classic arcade game where the goal is to stack falling geometric pieces to form complete horizontal lines and score points.",
  "tetris_description": "The development of the Tetris project using Swing in Java allowed the practical application of object-oriented programming concepts for the first time.\n\nThis project was also an opportunity to strengthen skills in managing properties files to offer multilingual options, as well as in integrating music to enhance the user experience.\n\nThis experience led to an in-depth understanding of architecture and programming techniques, preparing for similar challenges in the future and improving software development skills.",
  "azul_introduction": "Azul is a strategic game for 2 to 4 players who decorate a Portuguese palace with colorful tiles. The goal is to score points by creating patterns on a personal board, choosing and placing tiles wisely to maximize scores and minimize penalties.",
  "azul_description": "The MVC (Model, View, Controller) architecture was adopted to simplify the distribution of responsibilities and ensure a robust, easily modifiable program for future adaptations. To optimize productivity and provide clear benchmarks, several UML diagrams were developed to determine the project's requirements and needs. Then, various class diagrams were designed to establish the ideal architecture before starting the coding phase.\n\nThis project represented a valuable opportunity to strengthen skills in software architecture, enriching knowledge of development beyond simple programming.",
  "twitturtle_introduction": "A pun between Twitter and Turtle: Website derived from the famous social network, specialized for pet owners with additional features, such as:\n\n➜ The ability to add a pet to your profile\n➜ Tag animals in a post, add a location, and a type of post (event, advice, rescue)\n➜ Adopt an animal through a request and notification system\n➜ And many more features",
  "twitturtle_description": "This project was an exceptional opportunity for skill development in various fields. It allowed the initiation into JavaScript and the exploration of different APIs, notably those offered by Google Cloud.\n\nAdditionally, new skills were acquired by sending emails using the PHPMailer library and using the services of the company Sendinblue.",
  "pogo_introduction": "Pogo is a strategy game for two players, suitable for children aged 6 and up. It is easy to learn (about 2 minutes) and quick to play (about 10 minutes). The game includes a nine-square board and twelve stackable pieces (six light and six dark). The goal is to be the first player to place a piece of their color at the top of each stack on the board.\n\nIn this computer-adapted game, an AI can fight against a user or against itself.",
  "pogo_description": "A major challenge of this project was designing an evaluation method to determine the best move for the AI. This evaluation integrated various factors, such as the position of the tower, the number of tokens in its possession, the ability to capture an opponent's tower or protect itself from capture, as well as the possible movement distance.\n\nThis project strengthened skills in Python and understanding the implementation of the MinMax algorithm. Additionally, skills in creating graphical interfaces were developed using the QT library.",
  "unity_introduction": "Small project realized on Unity, which includes 3 different mini-games:\n\n➜ Apple Catcher\n➜ Brick Breaker\n➜ Furapi Bird",
  "unity_description": "This project offered the opportunity to discover the workings of Unity and explore new possibilities in game design. It also allowed initiation into the C# programming language. Being very close to Java, this language facilitated adaptation and leveraging the skills acquired during the project.",
  "ludiq_introduction": "Ludiq is a platform dedicated to sharing hobbies and activities through a website. Users can create discussions, publish posts, organize activities, and events related to their interests. These events are open to members who share the same passions.",
  "ludiq_description": "The project was developed with a Backend architecture in PHP and a Front-end in Angular. To ensure a robust structure, a Model - Services - Controller architecture was implemented.\n\nThis project provided the opportunity to become familiar with a framework and to master the concept of components, thereby enabling the development of more flexible and sustainable websites.",


  "technologies": "Technologies",
  "project-realization": "Project realization",
  "introduction": "Introduction",

  "ut_barista_description": "UT Barista is a club at UTBM responsible for supplying and maintaining coffee machines in living areas.",
  "outbm_description": "UTBM's LGBT club.",
  "ut_rc_description": "UT RC is a club at UTBM dedicated to enthusiasts of remote-controlled vehicles and devices via radio signals, such as cars, drones, etc.",
  "coust_ut_description": "Coust UT is a sewing and crochet club at UTBM.",
  "eventum_description": "Eventum is a website created as part of a UTBM project to bring students together for outings, evenings, and other events.",

  "internship": "Internship",
  "axopen_info": "I had the opportunity to work at Axopen as part of my assistant engineer internship during my fourth year of studies. Axopen is a company specialized in web development and audits. This internship allowed me to develop my skills in web development and immerse myself in a professional environment while collaborating within a team.",
  "axopen_project_one": "This was a project aimed at creating a program that generates SVG diagrams representing the architecture between applications, hosting services, and explains their operation through processes or connections. This project allowed me to develop my skills in C# programming language as well as the .NET framework. It also introduced me to GitLab, a development and hosting platform based on Git.",
  "axopen_project_two": "This project involved setting up a portal for a client to facilitate the verification of EXCEL files sent by country representatives. This project allowed me to improve my teamwork skills and gain more experience with frameworks such as Laravel (which uses PHP as the programming language) for back-end development and React for front-end development.",
  "axopen_period": "September 2023 - February 2024",
  "axopen_project_one_title": "First Project - IT Schematics",
  "axopen_project_two_title": "Second Project - HR Portal"
}
